In [15]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [16]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [23]:
%sql SELECT * FROM songplays LIMIT 5;
# %sql SELECT * FROM songplays WHERE song_id IS NOT NULL;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, 1542761878796, 80, 'paid', None, None, 774, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, 1542761921796, 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (3, 1542762125796, 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (4, 1542762193796, 80, 'paid', None, None, 774, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, 1542762329796, 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"')]

In [18]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(80, 'Tegan', 'Levine', 'F', 'paid'),
 (97, 'Kate', 'Harrell', 'F', 'paid'),
 (40, 'Tucker', 'Garrison', 'M', 'free'),
 (65, 'Amiya', 'Davidson', 'F', 'paid'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [19]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, 269.81832),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, 209.60608),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, 189.57016),
 ('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, 218.77506)]

In [20]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', nan, nan),
 ('ARXR32B1187FB57099', 'Gob', '', nan, nan),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', nan, nan),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', 35.21962, -80.01955)]

In [21]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1542761878796, 0, 21, 47, 11, 2018, 2),
 (1542761921796, 0, 21, 47, 11, 2018, 2),
 (1542762125796, 1, 21, 47, 11, 2018, 2),
 (1542762193796, 1, 21, 47, 11, 2018, 2),
 (1542762329796, 1, 21, 47, 11, 2018, 2)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

<br>

## Find the matching record

In [4]:
import os
import glob
import psycopg2
import pandas as pd

from sql_queries import song_select


conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
cur = conn.cursor()

log_files = get_files('data/log_data/')


def get_files(filepath):
    all_files = []
    for root, dirs, files in os.walk(filepath):
        files = glob.glob(os.path.join(root,'*.json'))
        for f in files :
            all_files.append(os.path.abspath(f))
    
    return all_files

30

<br>

Use pandas to find the log file with the single song/ artist match.

In [5]:
songs = pd.read_sql_query("SELECT * FROM songs", conn)
artists = pd.read_sql_query("SELECT * FROM artists", conn)

sa = pd.merge(songs, artists, on='artist_id')[['song_id', 'artist_id', 'title', 'name', 'duration']]

for i in range(len(log_files)):

    filepath = log_files[i]

    df = pd.read_json(filepath, lines=True)
    df = df.loc[df['page'] == 'NextSong']

    splays = pd.merge(sa, df, how='inner',
                      left_on=['title', 'name', 'duration'],
                      right_on=['song', 'artist', 'length'])
    
    if not splays.empty:
        print(f'Log file index {i} contains the matching record\n')

Log file index 24 contains the matching record

In [6]:
filepath = log_files[24]

df = pd.read_json(filepath, lines=True)
df = df.loc[df['page'] == 'NextSong']

print(df.loc[df.song.values == 'Setanta matins', ['song', 'artist', 'length']], '\n')

               song artist     length
483  Setanta matins  Elena  269.58322

<br>

Find the match with ETL code

In [7]:
for index, row in df.iterrows():    
    cur.execute(song_select, (row.song, row.artist, row.length))
    result = cur.fetchone()
    
#     songid, artistid = results if results else None, None
    if result:
        songid, artistid = result
    else:
        songid, artistid = None, None
    
#     songplay_data = [row.ts, row.userId, row.level, songid, artistid, row.sessionId, row.location, row.userAgent]
    songplay_data = [row.song, row.artist, row.length, songid, artistid]

    if songplay_data[0] == 'Setanta matins':
        print(songplay_data)

['Setanta matins', 'Elena', 269.58322, 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4']